benchmarks/TRACKS-MT3-GW-0.log
[info] Loading project definition from /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/project
[info] Set current project to benchmarks (in build file:/Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/)
[info] Compiling 1 Scala source to /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/target/scala-2.11/test-classes...
[info] Compiling 1 Scala source to /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/target/scala-2.11/gatling-classes...
Simulation com.azavea.ca.benchmark.WaveTracksStress started...

================================================================================
2016-10-01 14:43:37                                           5s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-10-01 14:43:42                                          10s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:43:47                                          15s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:43:52                                          20s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2      KO=0     )
> level-8, 9-day                                           (OK=1      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:43:57                                          25s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3      KO=0     )
> level-8, 9-day                                           (OK=2      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:02                                          30s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4      KO=0     )
> level-8, 9-day                                           (OK=2      KO=0     )
> level-8, 1-month                                         (OK=1      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:07                                          35s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5      KO=0     )
> level-8, 9-day                                           (OK=2      KO=0     )
> level-8, 1-month                                         (OK=2      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:12                                          40s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6      KO=0     )
> level-8, 9-day                                           (OK=2      KO=0     )
> level-8, 1-month                                         (OK=3      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:17                                          45s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=14     KO=0     )
> level-8, 9-day                                           (OK=5      KO=0     )
> level-8, 1-month                                         (OK=3      KO=0     )
> level-8, 27-day                                          (OK=1      KO=0     )
> level-8, 1-week                                          (OK=1      KO=0     )
> level-8, 18-day                                          (OK=2      KO=0     )
> level-8, 5-day                                           (OK=2      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:22                                          50s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=20     KO=0     )
> level-8, 9-day                                           (OK=7      KO=0     )
> level-8, 1-month                                         (OK=4      KO=0     )
> level-8, 27-day                                          (OK=4      KO=0     )
> level-8, 1-week                                          (OK=1      KO=0     )
> level-8, 18-day                                          (OK=2      KO=0     )
> level-8, 5-day                                           (OK=2      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:27                                          55s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=28     KO=0     )
> level-8, 9-day                                           (OK=7      KO=0     )
> level-8, 1-month                                         (OK=5      KO=0     )
> level-8, 27-day                                          (OK=5      KO=0     )
> level-8, 1-week                                          (OK=2      KO=0     )
> level-8, 18-day                                          (OK=4      KO=0     )
> level-8, 5-day                                           (OK=5      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:32                                          60s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 1      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=36     KO=0     )
> level-8, 9-day                                           (OK=8      KO=0     )
> level-8, 1-month                                         (OK=8      KO=0     )
> level-8, 27-day                                          (OK=5      KO=0     )
> level-8, 1-week                                          (OK=4      KO=0     )
> level-8, 18-day                                          (OK=5      KO=0     )
> level-8, 5-day                                           (OK=6      KO=0     )
================================================================================


================================================================================
2016-10-01 14:44:33                                          60s elapsed
---- Tracks Pyramid: GeoWave ---------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:1     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=38     KO=0     )
> level-8, 9-day                                           (OK=8      KO=0     )
> level-8, 1-month                                         (OK=8      KO=0     )
> level-8, 27-day                                          (OK=7      KO=0     )
> level-8, 1-week                                          (OK=4      KO=0     )
> level-8, 18-day                                          (OK=5      KO=0     )
> level-8, 5-day                                           (OK=6      KO=0     )
================================================================================

Simulation com.azavea.ca.benchmark.WaveTracksStress completed in 60 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                         38 (OK=38     KO=0     )
> min response time                                    309 (OK=309    KO=-     )
> max response time                                   6728 (OK=6728   KO=-     )
> mean response time                                  1554 (OK=1554   KO=-     )
> std deviation                                       2102 (OK=2102   KO=-     )
> response time 50th percentile                        683 (OK=683    KO=-     )
> response time 75th percentile                        970 (OK=970    KO=-     )
> response time 95th percentile                       6548 (OK=6548   KO=-     )
> response time 99th percentile                       6697 (OK=6697   KO=-     )
> mean requests/sec                                  0.623 (OK=0.623  KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                            25 ( 66%)
> 800 ms < t < 1200 ms                                   7 ( 18%)
> t > 1200 ms                                            6 ( 16%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 0s.
Please open the following file: /Users/eugene/proj/geowave-geomesa-comparative-analysis/benchmarks/target/gatling/wavetracksstress-1475347412297/index.html
[info] Simulation WaveTracksStress successful.
[info] Simulation(s) execution ended.
[success] Total time: 69 s, completed Oct 1, 2016 2:44:34 PM